api/actions/OrdersAction.php

    public static function create($customer_id , $orderData){

        $transaction = \Yii::$app->db->beginTransaction();

        try {
            $orders  = new Orders();
            $orders->customer_id = $customer_id;
            $orders->orderData = serialize($orderData);
            $orders->save();
---
INSERT INTO `orders` (`customer_id`, `orderData`) VALUES (225, 's:1375:\"orderDataorderDataorderData orderDataorderDataorderDataorderDataorderDataorderData orderDataorderDataorderDataorderDataorderDataorderData orderDataorderDataorderDataorderDataorderDataorderData orderDataorderDataorderDataorderDataorderDataorderData orderDataorderDataorderDataorderDataorderDataorderData orderDataorderDataorderDataorderDataorderDataorderData orderDataorderDataorderDataorderDataorderDataorderData orderDataorderDataorderDataorderDataorderDataorderData orderDataorderDataorderDataorderDataorderDataorderData orderDataorderDataorderDataorderDataorderDataorderData orderDataorderDataorderDataorderDataorderDataorderData orderDataorderDataorderDataorderDataorderDataorderData orderDataorderDataorderDataorderDataorderDataorderData orderDataorderDataorderDataorderDataorderDataorderData orderDataorderDataorderDataorderDataorderDataorderData orderDataorderDataorderDataorderDataorderDataorderData orderDataorderDataorderDataorderDataorderDataorderData orderDataorderDataorderDataorderDataorderDataorderData orderDataorderDataorderDataorderDataorderDataorderData orderDataorderDataorderDataorderDataorderDataorderData orderDataorderDataorderDataorderDataorderDataorderData orderDataorderDataorderDataorderDataorderDataorderData orderDataorderDataorderDataorderDataorderDataorderData orderDataorderDataorderDataorderDataorderDataorderData orderDataorderDataorderData\";')